#ifndef _COMMON_H    //防止重复定义（COMMON_H  开头)
#define _COMMON_H


#include "mcu.h"   //包含公共要素头文件

//=====================================================================
//函数名称：AryCpy
//函数返回：无
//参数说明：dest：复制后存放的数组；source：被复制的数组；len:复制的长度
//功能概要：从源数组复制指定长度的内容到目标数组
//=====================================================================
void AryCpy(uint8_t* dest,uint8_t* source,uint16_t len);





//=====================================================================
//函数名称：TimeStamp
//函数返回：无
//参数说明：gTime：日期时间数组
//功能概要：将日期时间转化为时间戳
//=====================================================================
uint64_t  TimeStamp(uint8_t* gTime);

#endif  //防止重复定义（COMMON_H 结尾）
