//=====================================================================
//文件名称：timer.h
//功能概要：timer底层驱动构件头文件
//制作单位：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//版    本：  2019-11-15  V2.0
//适用芯片：STM32
//=====================================================================
#ifndef TIMER_H
#define TIMER_H

#include "string.h"

#define TIMERB  2
#define TIMERC  7

//============================================================================
//函数名称：timer_init
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//                 time_ms 定时器中断的时间间隔，单位为毫秒。
//功能概要：时钟模块初始化，其中TIM1为高级定时器，TIM2、TIM15、TIM16为通用定时器，
//         TIM6、TIM7为基本定时器
//============================================================================
void timer_init(uint8_t timer_No,uint32_t time_ms);


//============================================================================
//函数名称：timer_enable_int
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：时钟模块使能，开启时钟模块中断及定时器中断
//============================================================================
void timer_enable_int(uint8_t timer_No);

//============================================================================
//函数名称：timer_disable_int
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：定时器中断除能
//============================================================================
void timer_disable_int(uint8_t timer_No);

//===================================================================
//函数名称：timer_get_int
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：获取timer模块中断标志
//函数返回：中断标志 1=有对应模块中断产生;0=无对应模块中断产生
//===================================================================
uint8_t timer_get_int(uint8_t timer_No);

//============================================================================
//函数名称：timer_clear_int
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：定时器清除中断标志
//============================================================================
void timer_clear_int(uint8_t timer_No);


#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
